In [5]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
#导入数据
data1= pd.read_csv(r'Basket-2018-06-01-2018-07-05.csv' )
data2= pd.read_csv(r'item-2018-06-01-2018-07-05.csv' )

In [6]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 571552 entries, 0 to 571551
Data columns (total 5 columns):
SHOP_DATETIME    571552 non-null object
STORE_CODE       571552 non-null object
POS_NO           571552 non-null int64
BASK_CODE        571552 non-null int64
BASK_SPEND       571552 non-null float64
dtypes: float64(1), int64(2), object(2)
memory usage: 21.8+ MB

In [7]:
data1.head()

  SHOP_DATETIME STORE_CODE  POS_NO  BASK_CODE  BASK_SPEND
0    2018-06-01       D007       3     250458         8.0
1    2018-06-01       D007       3     250200        32.7
2    2018-06-01       D007       1     161068        16.8
3    2018-06-01       D007       8       5325        30.4
4    2018-06-01       D007       8       5361       191.3

In [10]:
df1 = data1.dropna(how='any')

In [11]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 571552 entries, 0 to 571551
Data columns (total 5 columns):
SHOP_DATETIME    571552 non-null object
STORE_CODE       571552 non-null object
POS_NO           571552 non-null int64
BASK_CODE        571552 non-null int64
BASK_SPEND       571552 non-null float64
dtypes: float64(1), int64(2), object(2)
memory usage: 26.2+ MB

In [12]:
df1.head()

  SHOP_DATETIME STORE_CODE  POS_NO  BASK_CODE  BASK_SPEND
0    2018-06-01       D007       3     250458         8.0
1    2018-06-01       D007       3     250200        32.7
2    2018-06-01       D007       1     161068        16.8
3    2018-06-01       D007       8       5325        30.4
4    2018-06-01       D007       8       5361       191.3

In [8]:
data2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1732761 entries, 0 to 1732760
Data columns (total 10 columns):
SDATE              object
STORE_CODE         object
POSID              int64
BASK_CODE          int64
PROD_CODE          int64
ITEM_QUANTITY      float64
ITEM_SPEND         float64
NORMAL_PRICE       float64
DISCOUNT_TYPE      object
DISCOUNT_AMOUNT    float64
dtypes: float64(4), int64(3), object(3)
memory usage: 132.2+ MB

In [9]:
data2.head()

,SDATE,STORE_CODE,POSID,BASK_CODE,PROD_CODE,ITEM_QUANTITY,ITEM_SPEND,NORMAL_PRICE,DISCOUNT_TYPE,DISCOUNT_AMOUNT
0,2018-06-01,D007,3,250451,29405,1.000,1.70,2.0,m,-0.3
1,2018-06-01,D007,3,250451,13187,1.000,1.00,1.0,n,0.0
2,2018-06-01,D007,3,250243,196249,1.000,99.00,99.0,m,0.0
3,2018-06-01,D007,3,250243,199637,1.000,9.90,16.8,p,-6.9
4,2018-06-01,D007,1,160905,195012,3.222,18.69,5.8,n,0.0

In [13]:
df2 = data2.dropna(how='any')

In [17]:
df2['ITEM_QUANTITY']=df2['ITEM_QUANTITY'].astype('int')

In [18]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1732761 entries, 0 to 1732760
Data columns (total 10 columns):
SDATE              object
STORE_CODE         object
POSID              int64
BASK_CODE          int64
PROD_CODE          int64
ITEM_QUANTITY      int32
ITEM_SPEND         float64
NORMAL_PRICE       float64
DISCOUNT_TYPE      object
DISCOUNT_AMOUNT    float64
dtypes: float64(3), int32(1), int64(3), object(3)
memory usage: 138.8+ MB

In [19]:
df2.head()

,SDATE,STORE_CODE,POSID,BASK_CODE,PROD_CODE,ITEM_QUANTITY,ITEM_SPEND,NORMAL_PRICE,DISCOUNT_TYPE,DISCOUNT_AMOUNT
0,2018-06-01,D007,3,250451,29405,1,1.70,2.0,m,-0.3
1,2018-06-01,D007,3,250451,13187,1,1.00,1.0,n,0.0
2,2018-06-01,D007,3,250243,196249,1,99.00,99.0,m,0.0
3,2018-06-01,D007,3,250243,199637,1,9.90,16.8,p,-6.9
4,2018-06-01,D007,1,160905,195012,3,18.69,5.8,n,0.0

In [21]:
#购买商品数量前十的商品
df2[df2['ITEM_QUANTITY']>0].groupby('PROD_CODE')['ITEM_QUANTITY'].sum().sort_values(ascending=False).head(10)

PROD_CODE
149413    39931
86772     31365
220834    25704
7133      23028
61623     21828
124556    19907
205540    19313
1152      19183
124554    16681
178462    16519
Name: ITEM_QUANTITY, dtype: int32

In [22]:
#交易额前十的商品
df2[df2['ITEM_QUANTITY']>0].groupby('PROD_CODE')['ITEM_SPEND'].sum().sort_values(ascending=False).head(10)

PROD_CODE
7137      405783.50
7133      289784.00
136839    281211.40
149413    173820.33
1239      149153.20
154900    141034.70
220834    127622.90
88160     103467.20
3971       84972.00
11929      82989.80
Name: ITEM_SPEND, dtype: float64

In [23]:
#销售量前二十的日期
df2[df2['ITEM_QUANTITY']>0].groupby('SDATE')['ITEM_QUANTITY'].sum().sort_values(ascending=False).head(20)

SDATE
2018-06-17    147000
2018-06-18    140349
2018-06-16    117185
2018-06-13     86886
2018-06-15     83683
2018-06-03     77502
2018-06-02     75650
2018-06-01     74581
2018-06-30     73613
2018-06-10     73392
2018-07-01     70860
2018-06-14     69670
2018-06-27     69453
2018-07-03     68976
2018-06-05     67341
2018-07-04     67027
2018-06-09     65082
2018-07-02     65030
2018-06-29     60726
2018-06-23     60682
Name: ITEM_QUANTITY, dtype: int32

In [24]:
#客单价
sumPrice=df2[df2['ITEM_QUANTITY']>0]['NORMAL_PRICE'].sum()
countID=df2[df2['ITEM_QUANTITY']>0]['BASK_CODE'].count()
avgPrice = sumPrice/countID
print(avgPrice)

11.529110764144432